Revit 2027 API
BuiltInFailures.GroupFailures.NoAppropriateGroup Property
 There is no Group that can be placed in the current view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoAppropriateGroup { get; }
Public Shared ReadOnly Property NoAppropriateGroup As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoAppropriateGroup {
	FailureDefinitionId^ get ();
}
static member NoAppropriateGroup : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace